package text

import (
	"math/rand"
	"time"
)

var rng = rand.New(rand.NewSource(time.Now().UnixNano()))

type Text struct {
}

var exampleSentences = []string{
	"زبان رسمی ایران فارسی است.",
	"شیر نماد ملی ایران است و در بسیاری از هنرها و معماری‌ها دیده می‌شود.",
	"ایران دارای چهار فصل کاملاً متمایز است.",
	"تخت جمشید یکی از معروف‌ترین آثار باستانی ایران است.",
	"ایران یکی از بزرگترین تولیدکنندگان خاویار در جهان است.",
	"کویر لوت بزرگترین کویر ایران است و به عنوان گرم‌ترین نقطه زمین شناخته شده است.",
	"نوروز، که عید نو شمسی است، مهم‌ترین جشن سنتی ایرانیان است.",
	"چای ایرانی بخش مهمی از فرهنگ چای در ایران است و عمدتا در زمان میان وعده‌ها نوشیده می‌شود.",
	"هفت‌سین نمادی از جشن نوروز است که شامل هفت مورد با نام‌هایی است که با 'س' شروع می‌شود.",
	"ایران یکی از قدیمی‌ترین تمدن‌ها در جهان را داراست و تاریخ آن به بیش از ۷۰۰۰ سال پیش بازمی‌گردد.",
	"پل ورسک، که در سال ۱۳۱۵ خورشیدی ساخته شده، یکی از شاهکارهای مهندسی ایران است.",
	"زعفران ایرانی به عنوان باکیفیت‌ترین زعفران جهان شناخته می‌شود.",
	"بازار تبریز یکی از بزرگ‌ترین و قدیمی‌ترین بازارهای سرپوشیده در جهان است.",
	"فیلم‌سازی در ایران به عنوان یکی از پیشروان صنعت سینما در خاورمیانه شناخته می‌شود.",
	"موزه جواهرات ملی ایران شامل مجموعه‌ای از گران‌بهاترین جواهرات جهان است که بخشی از ذخایر ملی ایران به شمار می‌رود.",
	"دانشگاه تهران، بزرگ‌ترین و قدیمی‌ترین دانشگاه مدرن ایران، در سال ۱۳۱۳ خورشیدی تأسیس شد.",
	"غذاهای سنتی ایرانی مانند فسنجان، کباب و دیزی شهرت جهانی دارند.",
	"البرز مرکزی، که شامل قله دماوند است، بلندترین نقطه در ایران و خاورمیانه محسوب می‌شود.",
	"فردوسی، شاعر ایرانی، معروف به حماسه‌سرای شاهنامه، اثری که به حفظ زبان فارسی کمک شایانی کرد.",
}

// Sentence returns a random Persian sentence from the predefined list.
func (Text) Sentence() string {
	return exampleSentences[rng.Intn(len(exampleSentences))]
}
